In [1]:
pip install mysql_connector_python

Collecting mysql_connector_python
  Downloading mysql_connector_python-9.5.0-cp313-cp313-win_amd64.whl.metadata (7.7 kB)
Downloading mysql_connector_python-9.5.0-cp313-cp313-win_amd64.whl (16.5 MB)
   ---------------------------------------- 0.0/16.5 MB ? eta -:--:--
   ---------------------------------------- 0.0/16.5 MB ? eta -:--:--
   - -------------------------------------- 0.5/16.5 MB 2.2 MB/s eta 0:00:08
   -- ------------------------------------- 1.0/16.5 MB 2.4 MB/s eta 0:00:07
   --- ------------------------------------ 1.6/16.5 MB 2.6 MB/s eta 0:00:06
   ----- ---------------------------------- 2.1/16.5 MB 2.8 MB/s eta 0:00:06
   ------ --------------------------------- 2.9/16.5 MB 2.8 MB/s eta 0:00:05
   -------- ------------------------------- 3.4/16.5 MB 2.7 MB/s eta 0:00:05
   ---------- ----------------------------- 4.2/16.5 MB 2.9 MB/s eta 0:00:05
   ------------- -------------------------- 5.5/16.5 MB 3.2 MB/s eta 0:00:04
   ---------------- ----------------------- 6.8/16.5 MB 3.6 MB/s eta 0:00:03
   ------------------- -------------------- 7.9/16.5 MB 3.8 MB/s eta 0:00:03
   ---------------------- ----------------- 9.2/16.5 MB 3.9 MB/s eta 0:00:02
   ------------------------- -------------- 10.5/16.5 MB 4.2 MB/s eta 0:00:02
   ---------------------------- ----------- 11.8/16.5 MB 4.4 MB/s eta 0:00:02
   -------------------------------- ------- 13.4/16.5 MB 4.6 MB/s eta 0:00:01
   ----------------------------------- ---- 14.7/16.5 MB 4.7 MB/s eta 0:00:01
   -------------------------------------- - 16.0/16.5 MB 4.8 MB/s eta 0:00:01
   ---------------------------------------  16.3/16.5 MB 4.8 MB/s eta 0:00:01
   ---------------------------------------- 16.5/16.5 MB 4.5 MB/s eta 0:00:00
Installing collected packages: mysql_connector_python
Successfully installed mysql_connector_python-9.5.0
Note: you may need to restart the kernel to use updated packages.

In [2]:
#database connection
import mysql.connector

cnx =mysql.connector.connect(
        user = 'root',
        password = 'mohit2001',
        host = 'localhost',
        port = 3306,
        database = 'dena_bank'
)

if cnx.is_connected():
    print('connect to dena_bank database')

connect to dena_bank database

In [5]:
cur = cnx.cursor(buffered = True)
cur.execute("DROP TABLE IF EXISTS student")

In [6]:
cur.execute(
    """
       CREATE TABLE IF NOT EXISTS Students(
          student_id INT AUTO_INCREMENT PRIMARY KEY,
          name VARCHAR(50),
          age INT,
          grade VARCHAR(5)
       )
    """
)

In [7]:
cur.execute("DESC Students")
print(cur.fetchall())

[('student_id', 'int', 'NO', 'PRI', None, 'auto_increment'), ('name', 'varchar(50)', 'YES', '', None, ''), ('age', 'int', 'YES', '', None, ''), ('grade', 'varchar(5)', 'YES', '', None, '')]

In [8]:
cur.execute("DESC Students")
rows = cur.fetchall()
for row in rows:
    print(row)

('student_id', 'int', 'NO', 'PRI', None, 'auto_increment')
('name', 'varchar(50)', 'YES', '', None, '')
('age', 'int', 'YES', '', None, '')
('grade', 'varchar(5)', 'YES', '', None, '')

In [9]:
cur.description

[('Field', 253, None, None, None, None, 1, 0, 255),
 ('Type', 252, None, None, None, None, 0, 4241, 255),
 ('Null', 253, None, None, None, None, 0, 1, 255),
 ('Key', 254, None, None, None, None, 0, 4481, 255),
 ('Default', 252, None, None, None, None, 1, 144, 255),
 ('Extra', 253, None, None, None, None, 1, 0, 255)]

In [10]:
cur.execute("DESC Students")
rows = cur.fetchall()
headers = [col[0] for col in cur.description]


import pandas as pd
df = pd.DataFrame(rows , columns = headers)
df

        Field         Type Null  Key Default           Extra
0  student_id          int   NO  PRI    None  auto_increment
1        name  varchar(50)  YES         None
2         age          int  YES         None
3       grade   varchar(5)  YES         None

In [13]:
cur.execute(
    """
    INSERT INTO Students(name, age, grade) VALUES
    ('mohit', 28, 'A'),
    ('akash', 29, 'B'),
    ('ashish', 31, 'A'),
    ('abishek', 30, 'B');
    """
)

cnx.commit()

In [18]:
cur.execute("select * from Students")
rows = cur.fetchall()

import pandas as pd
headers = ['student_id','name', 'age' , 'grade']
data = pd.DataFrame(rows, columns = headers)
data

   student_id     name  age grade
0           1    mohit   28     A
1           2    akash   29     B
2           3   ashish   31     A
3           4  abishek   30     B
4           5    mohit   28     A
5           6    akash   29     B
6           7   ashish   31     A
7           8  abishek   30     B

In [19]:
#where
cur.execute("select * from students where grade = (%s)" , ('A',))

for rows in cur.fetchall():
    print(rows)

(1, 'mohit', 28, 'A')
(3, 'ashish', 31, 'A')
(5, 'mohit', 28, 'A')
(7, 'ashish', 31, 'A')

In [20]:
cur.execute("select * from students where grade = (%s) or grade = (%s)" , ('A','B'))

for rows in cur.fetchall():
    print(rows)

(1, 'mohit', 28, 'A')
(2, 'akash', 29, 'B')
(3, 'ashish', 31, 'A')
(4, 'abishek', 30, 'B')
(5, 'mohit', 28, 'A')
(6, 'akash', 29, 'B')
(7, 'ashish', 31, 'A')
(8, 'abishek', 30, 'B')

In [21]:
#closing the conection and cursor
cur.close()
cnx.close()

In [23]:
#SQLAlchemy

from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:mohit2001@localhost:3306/dena_bank")

In [24]:
from sqlalchemy import text

with engine.connect() as conn:
    result = conn.execute(
        text(
            "select database();"
        )
    )
    print(result.fetchall())

[('dena_bank',)]

In [25]:
#other way
result = pd.read_sql(
    text(
        "select * from Students"
    ),engine
)
result

   student_id     name  age grade
0           1    mohit   28     A
1           2    akash   29     B
2           3   ashish   31     A
3           4  abishek   30     B
4           5    mohit   28     A
5           6    akash   29     B
6           7   ashish   31     A
7           8  abishek   30     B

In [26]:
with engine.connect() as conn:
    result = conn.execute(
        text(
            "select * from students where grade = :g1"
        ),
        {'g1' : 'A'}
    )
    print(result.fetchall())

[(1, 'mohit', 28, 'A'), (3, 'ashish', 31, 'A'), (5, 'mohit', 28, 'A'), (7, 'ashish', 31, 'A')]

In [27]:
with engine.connect() as conn:
    result = conn.execute(
        text(
            "select * from students where grade = :g1 or grade = :g2"
        ),
        {'g1' : 'A', 'g2' : 'B'}
    )
    print(result.fetchall())

[(1, 'mohit', 28, 'A'), (2, 'akash', 29, 'B'), (3, 'ashish', 31, 'A'), (4, 'abishek', 30, 'B'), (5, 'mohit', 28, 'A'), (6, 'akash', 29, 'B'), (7, 'ashish', 31, 'A'), (8, 'abishek', 30, 'B')]